Repository: common-repository/atlas-specialist
Catalog: languages/atlas-specialist-*.po
Languages: ro_ro

source: You can find your profile URL in
ro_ro: Poti gasi URL-ul profilului tau in

source: My profile section
ro_ro: sectiunea Profilul meu

source: Display Atlas chat on your website?
ro_ro: Afiseaza chat-ul Atlas pe site-ul tau?

source: Copy the bellow code to any page to display your profile
ro_ro: Copiaza codul de mai jos pe orice pagina pentru a-ti afisa profilul

source: Copy the bellow code to any page to display your calendar
ro_ro: Copiaza codul de mai jos pe orice pagina pentru a-ti afisa calendarul

source: You can also add it to a sidebar from the <a href="widgets.php">Widgets page</a>
ro_ro: Poti sa o adaugi si pe o bara laterala folosind pagina de <a href="widgets.php">Piese</a>

source: Plugin settings.
ro_ro: Setari plugin.

source: Your specialist URL
ro_ro: URL Profil specialist

source: Display chat
ro_ro: Afisare Chat

source: Chat widget title
ro_ro: Titlu Widget Chat

source: Shortcodes
ro_ro: Shortcode

source: Save settings
ro_ro: Salveaza setarile

source: Atlas Specialist Calendar
ro_ro: Calendar Specialist Atlas

source: Add your specialist calendar
ro_ro: Adauga-ti calendarul de specialist

source: My Atlas Calendar
ro_ro: Calendarul meu Atlas
